Revit 2026 API

# ParameterValueIsSameType Method

---

Tests another instance is of the same value type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsSameType(
	ParameterValue other
)
```
```vb
Public Function IsSameType (
	other As ParameterValue
) As Boolean
```
```cpp
public:
bool IsSameType(
	ParameterValue^ other
)
```
```fsharp
member IsSameType :
        other : ParameterValue -> bool
```

#### Parameters

other ParameterValue
     The instance to compare with

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ParameterValue Class

Autodesk.Revit.DB Namespace